[
    {
        "jobID": "citi",
        "jobDates": "7/12-Present",
        "jobTitle": "Senior Front-End Developer",
        "employer": "Citigroup",
        "jobDescription": "<p> Lead front-end development of the Portfolio module of <em>InView</em>, Citibank & rsquo;s Private Banking application, deployed as both a web - based and hybrid mobile application, displaying sortable and filterable financial data about the accounts, assets and liabilities managed by private bankers.Developed the underlying code structure of the Portfolio module using Backbone.js, Underscore, jQuery &amp; RequireJS. HTML5 templates were implemented using Underscore, and styles were coded in SCSS and transpiled to CSS3. In addition to using RequireJS for optimization prior to deployment, the application &rsquo;s DOM and CSS3 animations were optimized for use on mobile platforms, focusing on keeping the DOM light and using standard methods for hardware - accelerating animations.</p><p> Following development of the module&rsquo;s structure, I provided instruction to the other members of my team on the use of the underlying technologies, as well as on-going support on their use. In addition to maintaining the over-all structure, I also developed several of the module&rsquo;s interconnected components.</p>"
    },
    {
        "jobID": "jackMorton",
        "jobDates": "4/10-7/12",
        "jobTitle": "Senior Flash/ActionScript Developer",
        "employer": "Jack Morton Worldwide",
        "jobDescription": "<p>Led development of websites and tools built using ActionScript 3 for use by Verizon Telecom and Verizon Wireless employees.</p> <ul> <li>Coded three generations/versions of a website used by Verizon Telecom sales reps. The site provides information about product packages, special offers and sales techniques, as well as interactive tools for comparing and calculating the cost of different packages so they can provide that information to telephone customers on the fly. As the content for the sites requires regular updates but for internal reasons cannot be connected to a database, the assets are cataloged in an XML document that is parsed by the application before assets are loaded.</li> <li>Developed an Adobe AIR application for Android tablets, desktop and online (as Flash content) to promote Verizon&rsquo;s launch of FiOS Quantum. The app includes videos, a custom player, interactive content developed in-house and incorporates content developed independently by another agency.</li> <li>Led coding and development of a site announcing Verizon&rsquo;s launch of their &ldquo;Rule The Air&rdquo; campaign to all internal employees. Developed the site&rsquo;s framework and integrated site content developed by other team members. Created, as part of the launch site, an application that allowed users to create a &ldquo;postcard&rdquo; by layering different elements related to the &ldquo;Rule The Air&rdquo; campaign (e.g., slogans, icons, iconic backgrounds, images of models/figures used in the campaign). Leveraging custom AS3 classes for creating JPEGs out of BitmapData, PHP and MySQL, the postcard could then be sent to the email addresses of friends or fellow employees from within the application.</li> <li>Led coding and development of additional sites and web-based applications for Verizon Telecom and Verizon Wireless, promoting offers and products in advance of the Holiday Season, integrating content from other in-house developers, as well as content provided by partnering agencies.</li></ul>"
    },
    {
        "jobID": "freelance",
        "jobDates": "4/95-Present",
        "jobTitle": "Web Developer &amp; Production Artist",
        "employer": "Freelance",
        "jobDescription": " <ul><li>In Progress: <em>Prospect Park Birds</em>, a mobile app for iOS and Android devices, developed with Backbone.js and PhoneGap/Cordova. The app provides a sortable catalog of the 200+ species of birds living and migrating through Brooklyn&rsquo;s Prospect Park annually, with photographs and information about each bird&rsquo;s appearance, habitat and seasonal frequency. Users will be able to update their Twitter status directly from the app in order to alert other bird watchers of recent sightings while keeping a record of which birds they&rsquo;ve sighted.</li> <li>Developed <em>MetroSaver</em>, an AIR for Android mobile application for use by New Yorkers to easily calculate exact amounts to add to their MTA MetroCard so their card balance can be used entirely on fares.</li> <li>Took part in Research In Motion&rsquo;s BlackBerry Playbook Challenge, developing <em>Chess Clock</em>, a mobile application, prior to the launch of BlackBerry&rsquo;s Playbook tablet.</li> <li>Partnered with another agency and an animator to develop a Facebook app for Redbox, announcing Redbox&rsquo;s Valentine&rsquo;s Day promotion. The app led visitors through a series of steps animated with candy hearts, helping them choose a movie rental for Valentine&rsquo;s Day and ultimately delivering a promotion code for use at Redbox kiosks.</li> <li>Worked with the Dikkers Cartoon Company to produce an interactive feature on Redbox&rsquo;s website announcing their billionth rental. The feature displayed a growing stack of DVD boxes, on top of which perched Redbox&rsquo;s CEO in a space suit. After the animation had played, a user could upload a photo of themselves or take a picture using their computer&rsquo;s camera, and the animation would replay displaying their face inside the helmet of the space suit. By filling out a short form, a unique URL could be sent to friends that launched the site displaying the personalized animation with the sender&rsquo;s photo in place.</li> <li>Acknowledged and thanked by V&eacute;ronique Brossier, the author of O&rsquo;Reilly&rsquo;s <em>Developing Android Applications with Adobe AIR</em>, for assistance in reviewing and testing chapters of her book prior to publication.</li> <li>Developed many aspects of the Dikkers Cartoon Company&rsquo;s site for launch, including a custom video player with a full set of audio and playback controls. The video player rotated videos, offered code for embedding the videos in a separate site, and provided options for sharing the video via numerous social sites or directly with friends via email.</li> </ul> <p>Design and produce websites and web content. Code HTML and CSS by hand and using Dreamweaver for websites and HTML email newsletters. Produce interactive Flash animations and presentations. Produce illustrations, retouch digitized photographs, set and style type for annual reports, university newsletters, advertisements and other printed materials. Clients include TBWA/Chiat, Rodan + Fields, Frankfurt Balkind Partners, Silver Communications, PrimeLook, Est&eacute;e Lauder, Prescriptives, Clinique, CityLimits.com, Flexigroup and New York University.</p>"
    },
    {
        "jobID": "mammalfish",
        "jobDates": "4/05-4/10",
        "jobTitle": "Developer, Mammalfish",
        "jobDescription": "<p>Worked as primary developer on a wide variety of projects for a boutique web development agency. Operated independently and in conjunction with other designers and programmers to design, develop and maintain websites, site content and RIAs. Used Adobe Flash and ActionScript 3 in the development of a variety of projects including:</p> <ul> <li>Sites developed entirely in Flash/AS3. Clients included HIT Entertainment (Thomas &amp; Friends, Bob the Builder, Angelina Ballerina) and Iconix Brands (Candies, OP, Rocawear, London Fog) </li> <li>Interactive and animated content used to update and enhance existing sites</li> <li>User forms that return validated data to ASP/PHP scripts for processing</li> <li>Photo and video galleries and &ldquo;juke boxes&rdquo;</li> <li>Client-managed RIAs (e.g., widgets, quizzes, promotional banners, galleries) drawing updatable content from XML files and SQL databases </li> <li>Banner advertisement campaigns</li> <li>Projects incorporating third-party AS3 libraries such as TweenLite/TweenMax and BulkLoader </li> </ul> <p>Other web technologies employed in these processes included ActionScript 2, CSS2, XHTML, AJAX libraries, PHP, ASP, XML and MS SQL and MySQL databases. Other projects have included: full site development from initial design comps through site building to launch; HTML email newsletters (within the limitations of email client support for CSS), forms built with validation using ASP/MS&nbsp;SQL, PHP/MySQL, and Flash/AS2 and AS3; custom photo uploader/resizer/galleries; logo development and design. Clients include HIT Entertainment (Thomas the Tank Engine, Bob the Builder, Angelina Ballerina), The Rachel Ray Show, Iconix Brands (Candies, OP, Rocawear, Badgley Mischka, London Fog), B&amp;G Foods, Power Pilates, The TED Prize, The American Association of Orthodontists, The Association of Executive Search Consultants, Oberon Media (casual gaming), Trepp and Magnitude Capital.</p>"
    },
    {
        "jobID": "clinique",
        "jobDates": "2/99-4/05",
        "jobTitle": "Designer",
        "employer": "Clinique, Est&eacute;e Lauder",
        "jobDescription": "<p>Worked on the development of Clinique & rsquo; s e &#8209; commerce website including assisting in the design of the site & rsquo; s interface.Maintained Clinique.com & rsquo; s Australia website.Rendered illustrations of cosmetic products and related objects.Retouched digital photographs for use in print and in -house comps.Designed and constructed a customized PostScript typeface for use in Clinique & rsquo; s printed materials, including the font & rsquo; s kerning tables and metrics.Handled any and all aspects of production for printed materials produced by Clinique & rsquo; s creative department including setting type, layout and pre - flight of posters, booklets and advertisements.</p>"
    },
    {
        "jobID": "prescriptives",
        "jobDates": "8/94-4/95",
        "jobTitle": "Illustrator/Production Artist",
        "employer": "Prescriptives, Est&eacute;e Lauder",
        "jobDescription": " < p > Generated all computer graphics and illustrations for the visual merchandising department of a major cosmetics corporation.</p>"
    },
    {
        "jobID": "wawrzewski",
        "jobDates": "11/93-8/94",
        "jobTitle": "Junior Designer",
        "employer": "Wawrzewski Graphic Design",
        "jobDescription": "<p>Worked with designer James Wawrzewski to design and produce printed materials for a variety of clients.</p>"
    }
]